/*********************************************************************************************
Copyright (C) 2016，北京镁伽机器人科技有限公司
文 件 名:  cmdCalibrate.c；
功能描述:  ;
函数列表:  ;
当前版本:  1.0.0;
版本改动:  ;
作    者:  CJ;
完成日期:  2016.12.15;
历史版本:  无;
*********************************************************************************************/
#include <string.h>
#include "cmdCalibrate.h"
#include "cmdMainParse.h"



/****************************************外部变量声明*****************************************/



/*****************************************局部宏定义******************************************/



/*************************************局部常量和类型定义**************************************/



/******************************************局部变量*******************************************/
SubCmdProFunc pCalibrateCmdFunc[CALBRCMD_RESERVE];



/******************************************函数实现*******************************************/
/*********************************************************************************************
函 数 名: cmdCalibrateBackLash;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void cmdCalibrateBackLash(u8 cmdDataLen, u8 *pCmdData)
{    

}

/*********************************************************************************************
函 数 名: cmdCalibrateBackLashEnd;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void cmdCalibrateBackLashEnd(u8 cmdDataLen, u8 *pCmdData)
{    

}


/*********************************************************************************************
函 数 名: cmdCalibrateMechError;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void cmdCalibrateMechError(u8 cmdDataLen, u8 *pCmdData)
{    

}

/*********************************************************************************************
函 数 名: cmdCalibrateMechErrorEnd;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void cmdCalibrateMechErrorEnd(u8 cmdDataLen, u8 *pCmdData)
{    

}


/*********************************************************************************************
函 数 名: cmdCalibrateCmdInit;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void cmdCalibrateCmdInit(void)
{
    memset(pCalibrateCmdFunc, 0, sizeof(pCalibrateCmdFunc));

    pCalibrateCmdFunc[CALBRCMD_BACKLASH]  = cmdCalibrateBackLash;
    pCalibrateCmdFunc[CALBRCMD_BLEND]     = cmdCalibrateBackLashEnd;
    pCalibrateCmdFunc[CALBRCMD_MECHERROR] = cmdCalibrateMechError;
    pCalibrateCmdFunc[CALBRCMD_MEEND]     = cmdCalibrateMechErrorEnd;
}

            
/*********************************************************************************************
函 数 名: cmdCalibrateCmdProc;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void cmdCalibrateCmdProc(CmdParseFrameStruct *pCmdStackFrame)
{    
    u8 dataLen = pCmdStackFrame->dataLen;
    u8 *pData = pCmdStackFrame->payload;

    
    if ((pCmdStackFrame->subType < CALBRCMD_RESERVE) && (pCalibrateCmdFunc[pCmdStackFrame->subType] != NULL))
    {    
        pCalibrateCmdFunc[pCmdStackFrame->subType](dataLen, pData);
    }
}



/*******************************************文件尾********************************************/