/*********************************************************************************************
Copyright (C) 2016，北京镁伽机器人科技有限公司
文 件 名:  bspCan.h;
功能描述:  ;
函数列表:  ;
当前版本:  1.0.0;
版本改动:  ;
作    者:  CJ;
完成日期:  2017.08.22;
历史版本:  无;
*********************************************************************************************/
#ifndef __BSP_CAN_H
#define __BSP_CAN_H



/******************************************包含文件*******************************************/
#include "stm32f4xx.h"



/****************************************外部变量声明*****************************************/



/*******************************************宏定义********************************************/



/***************************************常数和类型声明****************************************/
/*-------------CAN类型枚举-------------*/
typedef enum
{
    CANTYPE_A = 0,
    CANTYPE_B,
    CANTYPE_RESERVE
    
}CanTypeEnum;

/*-------------CAN波特率枚举-------------*/
typedef enum
{
    CANBAUD_1000 = 0,    //1000kBps
    CANBAUD_500,
    CANBAUD_250,
    CANBAUD_125,
    CANBAUD_100,
    CANBAUD_50,
    CANBAUD_20,
    CANBAUD_10,
    CANBAUD_RESERVE
    
}CanBaudEnum;

/*-------------CAN接口结构体-------------*/
typedef struct
{
    CanTypeEnum  idType;    //类型A或B
    CanBaudEnum  baud;      //波特率
    u8           group;
    
    u32 sendId;
    u32 receiveId;
    u32 groupId1;
    u32 groupId2;
    u32 radioId;
    
}CanIntfcStruct;



/******************************************变量声明*******************************************/



/******************************************函数声明*******************************************/
void bspCiCanInit(void);
void bspCiCanConfig(CanIntfcStruct canIntfc);
void bspCiCanSend(u32 sendId, u8 canRtr, u8 dataLen, u8 *data);
void bspCiCanReceive(CanRxMsg* rxMessage);
void bspCiCanITConfig(FunctionalState funcState);



/*****************************************头文件保护******************************************/
#endif
/*******************************************文件尾********************************************/