/*********************************************************************************************
Copyright (C) 2016，北京镁伽机器人科技有限公司
文 件 名:  servValve.h;
功能描述:  ;
函数列表:  ;
当前版本:  1.0.0;
版本改动:  ;
作    者:  CJ;
完成日期:  2018.06.22;
历史版本:  无;
*********************************************************************************************/
#ifndef __SERV_VALVE_H
#define __SERV_VALVE_H



/******************************************包含文件*******************************************/
#include "comDatatype.h"
#include "comEnum.h"
#include "pvtAlgorithm.h"



/****************************************外部变量声明*****************************************/



/*******************************************宏定义********************************************/



/***************************************常数和类型声明****************************************/
/*-------------通道连接的器件类型-----------*/
typedef enum
{
    MRVDEV_VALVE = 0,
    MRVDEV_MOTOR,
    MRVDEV_RESERVE
    
}MrvDeviceTypeEnum;

/*-----规划管理结构体------*/
typedef struct
{
	MrvDeviceTypeEnum   mrvCtrlType;    //控制器件类型   
	
    //电磁阀的时间分三段: 1. 开启前的延时时间；2. 开启时间；3. 保持时间
    //其中延时时间和开启时间固定，保持时间不定
    u16 delayTime;    //开启前的延时时间  单位为 1ms
	u16 openTime;     //开启段持续时间    单位为 1ms
	
	//相应的占空比也分三段: 1. 延时段占空比；2. 开启段占空比；3. 保持段占空比
	//其中延时段的占空比固定为0
	u16 openDuty;     //开启占空比，千分之
	u16 holdDuty;     //保持占空比，千分之

	u32 crc;
      
}MrvCtrlParaStruct;

/*-----规划管理结构体------*/
typedef struct
{
    ExecModeEnum execMode;    //执行模式
    
    u32 cycleNum;    //循环模式的循环数

    u32 crc;
      
}MrvPlanInfoStruct;

/*-------------波表结构体-------------*/
typedef struct
{
    bool bCycleQuery;      //查询循环数
    
    MotionStateEnum     lastState;       //波表上次状态
    MotionStateEnum     waveState;       //波表当前状态
    WaveWorkModeEnum    waveWorkMode;    //波表工作模式

    u32 startAddr;       //波表起始地址
    u32 bufferSize;      //波表Buffer大小

    u32 writableAddr;    //可写地址，是4Bytes整数倍
    u32 writableSize;    //可写的波表点数
      
}MrvWaveTableStruct;



/******************************************变量声明*******************************************/



/******************************************函数声明*******************************************/



/*****************************************头文件保护******************************************/
#endif
/*******************************************文件尾********************************************/
