/**********************************************************************************************
Copyright (C) 2016，北京镁伽机器人科技有限公司
文 件 名:  interrupt.c；
功能描述:  ;
函数列表:  ;
当前版本:  1.0.0;
版本改动:  ;
作    者:  CJ;
完成日期:  2016.08.25;
历史版本:  无;
**********************************************************************************************/
#include <string.h>
#include "interrupt.h"
#include "bspCan.h"
#include "servCommIntfc.h"
#include "eventManageTask.h"
#include "bspSdio.h"



/****************************************外部变量声明*****************************************/
extern u8 g_sdioDmaTxComplete;



/*****************************************局部宏定义******************************************/



/*************************************局部常量和类型定义**************************************/



/******************************************局部变量*******************************************/



/******************************************************************************/
/*            Cortex-M4 Processor Exceptions Handlers                         */
/******************************************************************************/

/**
  * @brief   This function handles NMI exception.
  * @param  None
  * @retval None
  */
void NMI_Handler(void)
{
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Memory Manage exception.
  * @param  None
  * @retval None
  */
void MemManage_Handler(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Bus Fault exception.
  * @param  None
  * @retval None
  */
void BusFault_Handler(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles Usage Fault exception.
  * @param  None
  * @retval None
  */
void UsageFault_Handler(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}

/**
  * @brief  This function handles SVCall exception.
  * @param  None
  * @retval None
  */
void SVC_Handler(void)
{
}

/**
  * @brief  This function handles Debug Monitor exception.
  * @param  None
  * @retval None
  */
void DebugMon_Handler(void)
{
}

/**
  * @brief  This function handles PendSVC exception.
  * @param  None
  * @retval None
  */
void PendSV_Handler(void)
{
}

/**
  * @brief  This function handles SysTick Handler.
  * @param  None
  * @retval None
  */
void SysTick_Handler(void)
{
}
/*********************************************************************************************/



/******************************************函数实现*******************************************/
/*********************************************************************************************
函 数 名: WWDG_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void WWDG_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: PVD_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void PVD_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TAMP_STAMP_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TAMP_STAMP_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: RTC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void RTC_WKUP_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: FLASH_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void FLASH_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: RCC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void RCC_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: EXTI0_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI0_IRQHandler(void)
{
    if (EXTI_GetITStatus(EXTI_Line0) != RESET)
    {   
        EXTI_ClearFlag(EXTI_Line0);

        irqEventOccur(EVENTSRC_FPGA, 0);
    } 
}


/*********************************************************************************************
函 数 名: EXTI1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI1_IRQHandler(void)
{
    if (EXTI_GetITStatus(EXTI_Line1) != RESET)
    {   
        EXTI_ClearFlag(EXTI_Line1);

        irqChanZProcess(CH2);
    }    
}


/*********************************************************************************************
函 数 名: EXTI2_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI2_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: EXTI3_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI3_IRQHandler(void)
{  

}


/*********************************************************************************************
函 数 名: EXTI4_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI4_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA1_Stream0_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream0_IRQHandler(void)
{
    
}


/*********************************************************************************************
函 数 名: DMA1_Stream1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream1_IRQHandler(void)
{
    if (DMA_GetFlagStatus(DMA1_Stream1, DMA_LISR_TCIF1) != RESET)    //接收到数据引发的中断
    {
        irqSensor1UartDmaComplReceive();
    }

    DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_FEIF1 | DMA_FLAG_DMEIF1 | DMA_FLAG_TEIF1 | DMA_FLAG_HTIF1 | DMA_FLAG_TCIF1);
}


/*********************************************************************************************
函 数 名: DMA1_Stream2_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream2_IRQHandler(void)
{
    if (DMA_GetFlagStatus(DMA1_Stream2, DMA_LISR_TCIF2) != RESET)    //接收到数据引发的中断
    {
#if !(GELGOOG_AXIS_4 || GELGOOG_AXIS_10)    //4轴和10轴只支持1路
        irqSensor2UartDmaComplReceive();
#endif
    }

    DMA_ClearFlag(DMA1_Stream2, DMA_FLAG_FEIF2 | DMA_FLAG_DMEIF2 | DMA_FLAG_TEIF2 | DMA_FLAG_HTIF2 | DMA_FLAG_TCIF2);
}


/*********************************************************************************************
函 数 名: DMA1_Stream3_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream3_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA1_Stream4_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream4_IRQHandler(void)
{
    
}


/*********************************************************************************************
函 数 名: DMA1_Stream5_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream5_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA1_Stream6_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream6_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: ADC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void ADC_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN1_TX_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN1_TX_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN1_RX0_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN1_RX0_IRQHandler(void)
{
    if (CAN_GetITStatus(CAN1, CAN_IT_FMP0) != RESET)
    {
        irqCiCanReceive();
    }
}


/*********************************************************************************************
函 数 名: CAN1_RX1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN1_RX1_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN1_SCE_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN1_SCE_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: EXTI9_5_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI9_5_IRQHandler(void)
{
    if (EXTI_GetITStatus(EXTI_Line7) != RESET)
    {   
        EXTI_ClearFlag(EXTI_Line7);

        irqChanZProcess(CH4);
    }
}


/*********************************************************************************************
函 数 名: TIM1_BRK_TIM9_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/                                 
void TIM1_BRK_TIM9_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM1_UP_TIM10_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM1_UP_TIM10_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM1_TRG_COM_TIM11_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM1_TRG_COM_TIM11_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM1_CC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM1_CC_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM2_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM2_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)
    {
        //根据方向判断下溢还是上溢
        if (TIM2->CR1 & TIM_CR1_DIR)
        {
            irqChanABProcess(CH1, ENCDIR_N);
        }
        else
        {
            irqChanABProcess(CH1, ENCDIR_P);
        }
    }

    TIM_ClearFlag(TIM2, TIM_FLAG_Update  | TIM_FLAG_CC1   | 
                        TIM_FLAG_CC2     | TIM_FLAG_CC3   | 
                        TIM_FLAG_CC4     | TIM_FLAG_COM   | 
                        TIM_FLAG_Trigger | TIM_FLAG_Break | 
                        TIM_FLAG_CC1OF   | TIM_FLAG_CC2OF | 
                        TIM_FLAG_CC3OF   | TIM_FLAG_CC4OF);
}


/*********************************************************************************************
函 数 名: TIM3_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM3_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET)
    {
        //根据方向判断下溢还是上溢
        if (TIM3->CR1 & TIM_CR1_DIR)
        {
            irqChanABProcess(CH2, ENCDIR_N);
        }
        else
        {
            irqChanABProcess(CH2, ENCDIR_P);
        }
    }

    TIM_ClearFlag(TIM3, TIM_FLAG_Update  | TIM_FLAG_CC1   | 
                        TIM_FLAG_CC2     | TIM_FLAG_CC3   | 
                        TIM_FLAG_CC4     | TIM_FLAG_COM   | 
                        TIM_FLAG_Trigger | TIM_FLAG_Break | 
                        TIM_FLAG_CC1OF   | TIM_FLAG_CC2OF | 
                        TIM_FLAG_CC3OF   | TIM_FLAG_CC4OF);
}


/*********************************************************************************************
函 数 名: TIM4_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM4_IRQHandler(void)
{

}



/*********************************************************************************************
函 数 名: I2C1_EV_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void I2C1_EV_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: I2C1_ER_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void I2C1_ER_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: I2C2_EV_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void I2C2_EV_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: I2C2_ER_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void I2C2_ER_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: SPI1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void SPI1_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: SPI2_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void SPI2_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: USART1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void USART1_IRQHandler(void)
{
    /*********这几个中断只能通过查询FLAG的方式进行判断********/
    if (USART_GetFlagStatus(USART1, USART_FLAG_PE) != RESET)  
    {  
        USART_ReceiveData(USART1);  
        USART_ClearFlag(USART1, USART_FLAG_PE);  
    }  

    if (USART_GetFlagStatus(USART1, USART_FLAG_ORE) != RESET)  
    {  
        USART_ReceiveData(USART1);  
        USART_ClearFlag(USART1, USART_FLAG_ORE);  
    }  

    if (USART_GetFlagStatus(USART1, USART_FLAG_FE) != RESET)  
    {  
        USART_ReceiveData(USART1);  
        USART_ClearFlag(USART1, USART_FLAG_FE);  
    }
    /*********************************************************/
    
    
    if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)    //接收到数据引发的中断
    {
        irqCiUartReceive();
    }

    USART_ClearFlag(USART1, USART_FLAG_CTS  |
                            USART_FLAG_LBD  |
                            USART_FLAG_TXE  |
                            USART_FLAG_TC   |
                            USART_FLAG_RXNE |
                            USART_FLAG_IDLE |
                            USART_FLAG_ORE  |
                            USART_FLAG_NE   |
                            USART_FLAG_FE   |
                            USART_FLAG_PE); 
}


/*********************************************************************************************
函 数 名: USART2_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void USART2_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: USART3_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void USART3_IRQHandler(void)
{
    /*********这几个中断只能通过查询FLAG的方式进行判断********/
    if (USART_GetFlagStatus(USART3, USART_FLAG_PE) != RESET)  
    {  
        USART_ReceiveData(USART3);  
        USART_ClearFlag(USART3, USART_FLAG_PE);  
    }  

    if (USART_GetFlagStatus(USART3, USART_FLAG_ORE) != RESET)  
    {  
        USART_ReceiveData(USART3);  
        USART_ClearFlag(USART3, USART_FLAG_ORE);  
    }  

    if (USART_GetFlagStatus(USART3, USART_FLAG_FE) != RESET)  
    {  
        USART_ReceiveData(USART3);  
        USART_ClearFlag(USART3, USART_FLAG_FE);  
    }
    /*********************************************************/
    
    
    if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)    //接收到数据引发的中断
    {
        irqSensor1UartReceive();
    }

    USART_ClearFlag(USART3, USART_FLAG_CTS  |
                            USART_FLAG_LBD  |
                            USART_FLAG_TXE  |
                            USART_FLAG_TC   |
                            USART_FLAG_RXNE |
                            USART_FLAG_IDLE |
                            USART_FLAG_ORE  |
                            USART_FLAG_NE   |
                            USART_FLAG_FE   |
                            USART_FLAG_PE); 
}


/*********************************************************************************************
函 数 名: EXTI15_10_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void EXTI15_10_IRQHandler(void)
{
    if (EXTI_GetITStatus(EXTI_Line10) != RESET)
    {   
        EXTI_ClearFlag(EXTI_Line10);

        irqChanZProcess(CH1);
    }

    if (EXTI_GetITStatus(EXTI_Line12) != RESET)
    {   
        EXTI_ClearFlag(EXTI_Line12);

        irqChanZProcess(CH3);
    }
}


/*********************************************************************************************
函 数 名: RTCAlarm_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void RTCAlarm_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: OTG_FS_WKUP_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void OTG_FS_WKUP_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM8_BRK_TIM12_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM8_BRK_TIM12_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM8_UP_TIM13_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM8_UP_TIM13_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM8, TIM_IT_Update) != RESET)
    {
        //根据方向判断下溢还是上溢
        if (TIM8->CR1 & TIM_CR1_DIR)
        {
            irqChanABProcess(CH4, ENCDIR_N);
        }
        else
        {
            irqChanABProcess(CH4, ENCDIR_P);
        }
    }

    TIM_ClearFlag(TIM8, TIM_FLAG_Update  | TIM_FLAG_CC1   | 
                        TIM_FLAG_CC2     | TIM_FLAG_CC3   | 
                        TIM_FLAG_CC4     | TIM_FLAG_COM   | 
                        TIM_FLAG_Trigger | TIM_FLAG_Break | 
                        TIM_FLAG_CC1OF   | TIM_FLAG_CC2OF | 
                        TIM_FLAG_CC3OF   | TIM_FLAG_CC4OF);
}


/*********************************************************************************************
函 数 名: TIM8_TRG_COM_TIM14_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM8_TRG_COM_TIM14_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM8_CC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM8_CC_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA1_Stream7_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA1_Stream7_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: FSMC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void FSMC_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: SDIO_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void SDIO_IRQHandler(void)
{
    if (SDIO_GetITStatus(SDIO_IT_DATAEND) != RESET)
    {
        SDIO_ClearITPendingBit(SDIO_IT_DATAEND);
    }  
    else if (SDIO_GetITStatus(SDIO_IT_DCRCFAIL) != RESET)
    {
        SDIO_ClearITPendingBit(SDIO_IT_DCRCFAIL);

    }
    else if (SDIO_GetITStatus(SDIO_IT_DTIMEOUT) != RESET)
    {
        SDIO_ClearITPendingBit(SDIO_IT_DTIMEOUT);
    }
    else if (SDIO_GetITStatus(SDIO_IT_RXOVERR) != RESET)
    {
        SDIO_ClearITPendingBit(SDIO_IT_RXOVERR);
    }
    else if (SDIO_GetITStatus(SDIO_IT_TXUNDERR) != RESET)
    {
        SDIO_ClearITPendingBit(SDIO_IT_TXUNDERR);
    }
    else if (SDIO_GetITStatus(SDIO_IT_STBITERR) != RESET)
    {
        SDIO_ClearITPendingBit(SDIO_IT_STBITERR);
    }

    SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | 
                  SDIO_IT_DATAEND  | SDIO_IT_TXFIFOHE | 
                  SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
                  SDIO_IT_RXOVERR  | SDIO_IT_STBITERR,  DISABLE);
}


/*********************************************************************************************
函 数 名: TIM5_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM5_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET)
    {
        //根据方向判断下溢还是上溢
        if (TIM5->CR1 & TIM_CR1_DIR)
        {
            irqChanABProcess(CH3, ENCDIR_N);
        }
        else
        {
            irqChanABProcess(CH3, ENCDIR_P);
        }
    }

    TIM_ClearFlag(TIM5, TIM_FLAG_Update  | TIM_FLAG_CC1   | 
                        TIM_FLAG_CC2     | TIM_FLAG_CC3   | 
                        TIM_FLAG_CC4     | TIM_FLAG_COM   | 
                        TIM_FLAG_Trigger | TIM_FLAG_Break | 
                        TIM_FLAG_CC1OF   | TIM_FLAG_CC2OF | 
                        TIM_FLAG_CC3OF   | TIM_FLAG_CC4OF);
}


/*********************************************************************************************
函 数 名: SPI3_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void SPI3_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: UART4_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void UART4_IRQHandler(void)
{
    /*********这几个中断只能通过查询FLAG的方式进行判断********/
    if (USART_GetFlagStatus(UART4, USART_FLAG_PE) != RESET)  
    {  
        USART_ReceiveData(UART4);  
        USART_ClearFlag(UART4, USART_FLAG_PE);  
    }  

    if (USART_GetFlagStatus(UART4, USART_FLAG_ORE) != RESET)  
    {  
        USART_ReceiveData(UART4);  
        USART_ClearFlag(UART4, USART_FLAG_ORE);  
    }  

    if (USART_GetFlagStatus(UART4, USART_FLAG_FE) != RESET)  
    {  
        USART_ReceiveData(UART4);  
        USART_ClearFlag(UART4, USART_FLAG_FE);  
    }
    /*********************************************************/
    
    if (USART_GetITStatus(UART4, USART_IT_RXNE) != RESET)    //接收到数据引发的中断
    {
#if !(GELGOOG_AXIS_4 || GELGOOG_AXIS_10)    //4轴和10轴只支持1路
        irqSensor2UartReceive();
#endif
    }

    USART_ClearFlag(UART4, USART_FLAG_CTS  |
                           USART_FLAG_LBD  |
                           USART_FLAG_TXE  |
                           USART_FLAG_TC   |
                           USART_FLAG_RXNE |
                           USART_FLAG_IDLE |
                           USART_FLAG_ORE  |
                           USART_FLAG_NE   |
                           USART_FLAG_FE   |
                           USART_FLAG_PE); 

}


/*********************************************************************************************
函 数 名: UART5_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void UART5_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM6_DAC_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM6_DAC_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: TIM7_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void TIM7_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA2_Stream0_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream0_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA2_Stream1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream1_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA2_Stream2_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream2_IRQHandler(void)
{
    irqCiUartDmaComplReceive();
}


/*********************************************************************************************
函 数 名: DMA2_Stream3_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream3_IRQHandler(void)
{
    if (DMA_GetFlagStatus(DMA2_Stream3, DMA_LISR_TCIF3) != RESET)
    {
        g_sdioDmaTxComplete = true;
    }

    DMA_ClearFlag(DMA2_Stream3, DMA_FLAG_FEIF3  | 
                                DMA_FLAG_DMEIF3 | 
                                DMA_FLAG_TEIF3  | 
                                DMA_FLAG_HTIF3  | 
                                DMA_FLAG_TCIF3);
}


/*********************************************************************************************
函 数 名: DMA2_Stream4_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream4_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: ETH_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void ETH_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: ETH_WKUP_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void ETH_WKUP_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN2_TX_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN2_TX_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN2_RX0_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN2_RX0_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN2_RX1_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN2_RX1_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CAN2_SCE_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CAN2_SCE_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: OTG_FS_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void OTG_FS_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA2_Stream5_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream5_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DMA2_Stream6_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream6_IRQHandler(void)
{
    DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_FEIF6 | DMA_FLAG_DMEIF6 | DMA_FLAG_TEIF6 | DMA_FLAG_HTIF6 | DMA_FLAG_TCIF6);
}


/*********************************************************************************************
函 数 名: DMA2_Stream7_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DMA2_Stream7_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: USART6_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void USART6_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: I2C3_EV_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void I2C3_EV_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: I2C3_ER_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void I2C3_ER_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: OTG_HS_EP1_OUT_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void OTG_HS_EP1_OUT_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: OTG_HS_EP1_IN_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void OTG_HS_EP1_IN_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: OTG_HS_WKUP_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void OTG_HS_WKUP_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: OTG_HS_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void OTG_HS_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: DCMI_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void DCMI_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: CRYP_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void CRYP_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: HASH_RNG_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void HASH_RNG_IRQHandler(void)
{

}


/*********************************************************************************************
函 数 名: FPU_IRQHandler;
实现功能:  
输入参数: 无;
输出参数: 无;
返 回 值: 无;
*********************************************************************************************/
void FPU_IRQHandler(void)
{

}



/*******************************************文件尾********************************************/
